#+TITLE: A*PA: A* Pairwise Aligner
#+PROPERTY: header-args :eval no-export :exports results

A global pairwise sequence aligner using A*.

Co-authored by [[https://github.com/pesho-ivanov][@pesho-ivanov]] and [[https://github.com/RagnarGrootKoerkamp][@RagnarGrootKoerkamp]].

- Usage ::
  ~cargo run --release -- -i <input>.{seq,txt,fasta} -o output.csv~

  This globally aligns sequence pairs from the input and writes a csv with lines of
  ~{cost},{score}~. *You will need Rust nightly!*

  If you run into any kind of problem, please (/please/ 🥺) make an issue or
  reach out on twitter or matrix (@curious_coding:matrix.org).
- Citations ::
  Please cite the Bioinformatics paper. The bioRxiv version includes the
  supplement and has slightly nicer formatting.
  - BioRxiv preprint:

    *Ragnar Groot Koerkamp*, *Pesho Ivanov*.
    "Exact global alignment using A* with chaining seed heuristic and match pruning".
    bioRxiv (2024). [[https://doi.org/10.1101/2022.09.19.508631][10.1101/2022.09.19.508631]]
  - OUP Bioinformatics paper:

    *Ragnar Groot Koerkamp*, *Pesho Ivanov*.
    "Exact global alignment using a* with chaining seed heuristic and match pruning".
    Bioinformatics (2024). [[https://doi.org/10.1093/bioinformatics/btae032][10.1093/bioinformatics/btae032]]
- Links ::
  - Twitter: [[https://mobile.twitter.com/curious_coding][@curious_coding]], [[https://mobile.twitter.com/peshotrie][@peshotrie]],
  - Blog: [[https://research.curiouscoding.nl]]
- Disclaimer ::
  A*PA can be slow and/or go out of memory when the error rate is high ($\gg
  10\%$) or when long indels are present. You could try
  lower/higher $k$, and more/less pruning, but otherwise use Edlib or BiWFA.

** Command line application

- [[https://rustup.rs/][Install rustup]], enable ~nightly~ (~rustup install nightly~ ~rustup default nightly~), and clone this repo.
- ~cargo run --release -- -n 100000~ should already work and run on some randomly generated sequences.
- If you get build errors related to ~sdl2~ and/or missing ~ttf~ files, disable
  the visualizer by passing ~--no-default-features~ to ~cargo~: ~cargo run
  --release --no-default-features -- <flags>~. Alternatively, install ~sdl2~ using e.g. ~apt-get install libsdl2-ttf-dev~.

#+begin_src shell :exports both :results verbatim
cargo run --release -- -h
#+end_src

#+RESULTS:
#+begin_example
Globally align pairs of sequences using A*PA

Usage: pa-bin [OPTIONS] <--input <INPUT>|--length <LENGTH>>

Options:
  -i, --input <INPUT>    A .seq, .txt, or Fasta file with sequence pairs to align
  -o, --output <OUTPUT>  Write a .csv of `{cost},{cigar}` lines
      --no-dt            Do not use the diagonal-transition optimization
  -s, --silent...        Print less stats. Pass twice for summary line only
  -h, --help             Print help (see more with '--help')

Heuristic:
  -H, --heuristic <HEURISTIC>  [default: gcsh] [possible values: none, zero, gap, sh, csh, gcsh,
                               gap-cost, affine]
  -r <r>                       Seed potential [default: 2]
  -k <k>                       Seed length [default: 15]
      --prune <PRUNE>          [default: start] [possible values: none, start, end, both]

Generated input:
  -n, --length <LENGTH>          Target length of each generated sequence [default: 1000]
  -e, --error-rate <ERROR_RATE>  Error rate between sequences [default: 0.05]

Visualizer:
  -v, --visualize <WHEN>  Interactive visualizer. See --help for more [default: none] [possible
                          values: none, first, last, all, layers]
#+end_example

